{"articles": [{
  "title": "Pennsylvania's Attorney General Thinks He & His Peers Are The New Check On Trump",
  "image_url": "https://typeset-beta.imgix.net/2017/3/21/647197788.jpg?w=740&h=437&fit=crop&crop=faces&auto=format&q=70&dpr=2",
  "author": "SARAH FRIEDMANN",
  "text": "In the two months that Donald Trump has been president, attorneys general across the county have already taken on leading roles challenging his policies. Most of that has been through legal channels, such as when Democratic state attorneys general united to denounce Trump's travel ban executive order in January and later filed an amicus brief in support of Washington's lawsuit against it. But sometimes, it has taken other forms. Last month, Pennsylvania Attorney General Josh Shapiro made headlines when he shared an exchange with Trump that suggested the president believed recent anti-Semitic attacks were actually false flags. After asking the president about how he would respond to the spate of bomb threats called into Jewish institutions and the vandalism to Jewish cemeteries, Shapiro said the president told him ‘Sometimes it’s the reverse, to make people — or to make others — look bad.' Although Trump's deputy press secretary, Sarah Huckabee Sanders deflected concerns about anti-Semitism by pointing to the content his address to the joint sessions of Congress, Shapiro's account validated many critics' concerns about Trump. In a Facebook Live interview on Monday, Shapiro told Bustle's politics editor how he hoped the president would have responded. I hoped he would have said 'In no uncertain terms, we condemn it.' And then spoken specifically with us, law enforcement leaders of our respective states, on how we can work together to combat anti-Semitism, racism, and hate speech threats, Shapiro said. Leaders need to speak with moral clarity. You need to speak with moral clarity on these issues, especially when your the present of the United States. SOURCE: Bustle on Facebook. At the same time, Shapiro stressed that it was not his job as an attorney general to make a law nor challenge ones simply because he disagreed with them. The test is always about the rule of law, not whether I like or dislike something the president is doing, but the rule of law, Shapiro said. However, Shapiro did acknowledge that attorneys general were taking on new responsibilities because of Trump's decisions and Congress' reactions to them, or, according to him, lack thereof. I think what we're beginning to see, because Congress has seemingly abrogated its responsibility in that checks-and-balances structure, is that we're seeing the states and the state attorneys general become a check on the federal executive branch, Shapiro said. I think that's really critical.  Although Shapiro has been speculated about as a possible candidate for senator and governor of Pennsylvania, he said that his heart lies in being a legal advocate — at least for now. I get to protect people's rights. I get to make sure that communities are safe. I get to go out and ensure equality in our communities, Shapiro said. These are things that I think are fundamental to our democracy. It's fundamental to who I am and, ultimately, I think this is the most impactful job in government today."},{
  "title": "Here’s Paul Ryan Grinning While He Signs A Bill To Drug Test The Unemployed",
  "image_url": "https://typeset-beta.imgix.net/2017/3/20/654040090.jpg?w=740&h=437&fit=crop&crop=faces&auto=format&q=70&dpr=2",
  "author": "MEHREEN KASANA",
  "text": "In a questionable attempt to address the wastage of government funding, Congressional Republicans voted to overturn an Obama-era regulation that restricted the number of unemployment insurance beneficiaries to undergo drug testing. Congressional Republicans demanded that states be given the authority to execute drug tests in industries beyond those which the Labor Department specified in the 2012 law. On Sunday, House Speaker Paul Ryan tweeted a grinning photo of himself signing the bill while sitting next to Texas Rep. Kevin Brady, author of the resolution and one of the most vocal opponents of the Obama-era regulation.  Critics have voiced their concern by saying the repeal of the bill would create more problems than offer solutions. According to ThinkProgress, 12 states in America have so far executed drug tests for welfare beneficiaries. And the results have not been reassuring. After spending a whopping $2 million to carry out these drug tests, no conclusive results have been shared with the public. In fact, ThinkProgress reports, states like Michigan and Arizona found no drug users at all. Ryan's controversial photo comes after February when the House of Representatives passed the House Joint Resolution 42. Ryan's expressions of glee and excitement have been criticized for demonstrating obliviousness to the plight of unemployed Americans who, under this resolution, are likely to suffer more, contrary to what proponents of the move insist. View image on Twitter. View image on Twitter.  Follow.  Paul Ryan ✔ @SpeakerRyan. Another one heads to President Trump’s desk. This legislation allows states to have drug testing to receive federal unemployment benefits. 2:26 PM - 19 Mar 2017. 4,463 4,463 Retweets   9,651 9,651 likes. SOURCE: Paul Ryan on Twitter. Supporters of overturning the Obama-era regulation — like Gov. Scott Walker from Wisconsin, Phil Bryant from Mississippi and Gov. Greg Abbott from Texas, Politico reports — say the repeal can assist Americans suffering drug abuse to get the help they need so as to gain re-entry in the workforce as efficient workers. Critics, however, claim that the repeal only seeks to humiliate those suffering drug abuse and seeking employment. One devastating consequence of the legislation would expose virtually anyone looking for unemployment aid to the arbitrary and financially-counterproductive judgment of drug tests. View image on Twitter. View image on Twitter.  Follow.  VICE News ✔ @vicenews. Paul Ryan proudly unveils new law that allows states to drug test people on unemployment. 9:48 AM - 20 Mar 2017.  78 78 Retweets   84 84 likes. SOURCE: VICE News on Twitter. This isn't the first time a politician has displayed unabashed glee while demanding for a policy that could destroy the lives of many low-income Americans. In 2015, Walker tried to pass food stamp drug testing off as a 'progressive thing' in a statement to The Huffington Post. Ryan's photo is particularly tasteless given the fact that drug testing people in search of welfare does several things: it fails to address substance abuse, it wastes the very same money Republicans are perennially moaning about, and it could leave marginalized Americans utterly exposed to lack of financial help and, naturally, a secure way to live in society. It's a vicious cycle, and Ryan's smile can only be construed as cruel in the light of such conditions."
  }]
}
